; domain
(define (domain emergency)
  (:requirements :strips :typing)

  (:types
    drone
    person
    crate
    location
    content
    arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (arm-of ?a - arm ?d - drone)
    (free ?a - arm)
    (holding ?a - arm ?c - crate)

    (crate-has ?c - crate ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
    )
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (arm-of ?a ?d)
      (free ?a)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (free ?a))
      (holding ?a ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (arm-of ?a ?d)
      (holding ?a ?c)
      (crate-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (free ?a)
      (not (holding ?a ?c))
    )
  )

)

; problem
(define (problem emergency_d1_l35_p35_c35_g35)
(:domain emergency)
(:objects
	drone1 - drone
	drone1_arm1 - arm
	drone1_arm2 - arm
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
)
(:init
	(at-drone drone1 depot)
	(arm-of drone1_arm1 drone1)
	(arm-of drone1_arm2 drone1)
	(free drone1_arm1)
	(free drone1_arm2)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-crate crate6 depot)
	(at-crate crate7 depot)
	(at-crate crate8 depot)
	(at-crate crate9 depot)
	(at-crate crate10 depot)
	(at-crate crate11 depot)
	(at-crate crate12 depot)
	(at-crate crate13 depot)
	(at-crate crate14 depot)
	(at-crate crate15 depot)
	(at-crate crate16 depot)
	(at-crate crate17 depot)
	(at-crate crate18 depot)
	(at-crate crate19 depot)
	(at-crate crate20 depot)
	(at-crate crate21 depot)
	(at-crate crate22 depot)
	(at-crate crate23 depot)
	(at-crate crate24 depot)
	(at-crate crate25 depot)
	(at-crate crate26 depot)
	(at-crate crate27 depot)
	(at-crate crate28 depot)
	(at-crate crate29 depot)
	(at-crate crate30 depot)
	(at-crate crate31 depot)
	(at-crate crate32 depot)
	(at-crate crate33 depot)
	(at-crate crate34 depot)
	(at-crate crate35 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 food)
	(crate-has crate5 food)
	(crate-has crate6 food)
	(crate-has crate7 food)
	(crate-has crate8 food)
	(crate-has crate9 food)
	(crate-has crate10 food)
	(crate-has crate11 medicine)
	(crate-has crate12 medicine)
	(crate-has crate13 medicine)
	(crate-has crate14 medicine)
	(crate-has crate15 medicine)
	(crate-has crate16 medicine)
	(crate-has crate17 medicine)
	(crate-has crate18 medicine)
	(crate-has crate19 medicine)
	(crate-has crate20 medicine)
	(crate-has crate21 medicine)
	(crate-has crate22 medicine)
	(crate-has crate23 medicine)
	(crate-has crate24 medicine)
	(crate-has crate25 medicine)
	(crate-has crate26 medicine)
	(crate-has crate27 medicine)
	(crate-has crate28 medicine)
	(crate-has crate29 medicine)
	(crate-has crate30 medicine)
	(crate-has crate31 medicine)
	(crate-has crate32 medicine)
	(crate-has crate33 medicine)
	(crate-has crate34 medicine)
	(crate-has crate35 medicine)
	(at-person person1 loc1)
	(at-person person2 loc18)
	(at-person person3 loc13)
	(at-person person4 loc29)
	(at-person person5 loc28)
	(at-person person6 loc14)
	(at-person person7 loc32)
	(at-person person8 loc8)
	(at-person person9 loc25)
	(at-person person10 loc6)
	(at-person person11 loc12)
	(at-person person12 loc2)
	(at-person person13 loc9)
	(at-person person14 loc25)
	(at-person person15 loc13)
	(at-person person16 loc4)
	(at-person person17 loc11)
	(at-person person18 loc34)
	(at-person person19 loc23)
	(at-person person20 loc6)
	(at-person person21 loc16)
	(at-person person22 loc18)
	(at-person person23 loc29)
	(at-person person24 loc34)
	(at-person person25 loc28)
	(at-person person26 loc31)
	(at-person person27 loc35)
	(at-person person28 loc20)
	(at-person person29 loc24)
	(at-person person30 loc1)
	(at-person person31 loc27)
	(at-person person32 loc7)
	(at-person person33 loc20)
	(at-person person34 loc2)
	(at-person person35 loc15)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person7 medicine)
	(person-has person8 food)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person12 food)
	(person-has person12 medicine)
	(person-has person13 food)
	(person-has person13 medicine)
	(person-has person14 food)
	(person-has person14 medicine)
	(person-has person15 medicine)
	(person-has person17 food)
	(person-has person18 food)
	(person-has person18 medicine)
	(person-has person21 medicine)
	(person-has person24 medicine)
	(person-has person25 medicine)
	(person-has person26 food)
	(person-has person26 medicine)
	(person-has person28 medicine)
	(person-has person29 food)
	(person-has person29 medicine)
	(person-has person30 medicine)
	(person-has person31 medicine)
	(person-has person32 food)
	(person-has person34 medicine)
	(person-has person35 medicine)
))
)

; plan
1. (pick-up drone1 drone1_arm1 crate35 depot)
   deleted: (at-crate crate35 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate35)
   goals met: 1 of 36
2. (pick-up drone1 drone1_arm2 crate10 depot)
   deleted: (at-crate crate10 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate10)
   goals met: 1 of 36
3. (fly drone1 depot loc32)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc32)
   goals met: 0 of 36
4. (deliver drone1 drone1_arm1 crate35 person7 loc32 medicine)
   deleted: (holding drone1_arm1 crate35)
   added: (person-has person7 medicine) (free drone1_arm1)
   goals met: 1 of 36
5. (fly drone1 loc32 depot)
   deleted: (at-drone drone1 loc32)
   added: (at-drone drone1 depot)
   goals met: 2 of 36
6. (pick-up drone1 drone1_arm1 crate34 depot)
   deleted: (at-crate crate34 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate34)
   goals met: 2 of 36
7. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 1 of 36
8. (deliver drone1 drone1_arm1 crate34 person4 loc29 medicine)
   deleted: (holding drone1_arm1 crate34)
   added: (person-has person4 medicine) (free drone1_arm1)
   goals met: 2 of 36
9. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 3 of 36
10. (pick-up drone1 drone1_arm1 crate33 depot)
   deleted: (at-crate crate33 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate33)
   goals met: 3 of 36
11. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 2 of 36
12. (deliver drone1 drone1_arm1 crate33 person31 loc27 medicine)
   deleted: (holding drone1_arm1 crate33)
   added: (person-has person31 medicine) (free drone1_arm1)
   goals met: 3 of 36
13. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 4 of 36
14. (pick-up drone1 drone1_arm1 crate32 depot)
   deleted: (at-crate crate32 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate32)
   goals met: 4 of 36
15. (fly drone1 depot loc20)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc20)
   goals met: 3 of 36
16. (deliver drone1 drone1_arm1 crate32 person28 loc20 medicine)
   deleted: (holding drone1_arm1 crate32)
   added: (person-has person28 medicine) (free drone1_arm1)
   goals met: 4 of 36
17. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 5 of 36
18. (pick-up drone1 drone1_arm1 crate31 depot)
   deleted: (at-crate crate31 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate31)
   goals met: 5 of 36
19. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 4 of 36
20. (deliver drone1 drone1_arm1 crate31 person21 loc16 medicine)
   deleted: (holding drone1_arm1 crate31)
   added: (person-has person21 medicine) (free drone1_arm1)
   goals met: 5 of 36
21. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 6 of 36
22. (pick-up drone1 drone1_arm1 crate30 depot)
   deleted: (at-crate crate30 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate30)
   goals met: 6 of 36
23. (fly drone1 depot loc15)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc15)
   goals met: 5 of 36
24. (deliver drone1 drone1_arm1 crate30 person35 loc15 medicine)
   deleted: (holding drone1_arm1 crate30)
   added: (person-has person35 medicine) (free drone1_arm1)
   goals met: 6 of 36
25. (fly drone1 loc15 depot)
   deleted: (at-drone drone1 loc15)
   added: (at-drone drone1 depot)
   goals met: 7 of 36
26. (pick-up drone1 drone1_arm1 crate29 depot)
   deleted: (at-crate crate29 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate29)
   goals met: 7 of 36
27. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 6 of 36
28. (deliver drone1 drone1_arm1 crate29 person11 loc12 medicine)
   deleted: (holding drone1_arm1 crate29)
   added: (person-has person11 medicine) (free drone1_arm1)
   goals met: 7 of 36
29. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 8 of 36
30. (pick-up drone1 drone1_arm1 crate28 depot)
   deleted: (at-crate crate28 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate28)
   goals met: 8 of 36
31. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 7 of 36
32. (deliver drone1 drone1_arm2 crate10 person17 loc11 food)
   deleted: (holding drone1_arm2 crate10)
   added: (person-has person17 food) (free drone1_arm2)
   goals met: 8 of 36
33. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 9 of 36
34. (pick-up drone1 drone1_arm2 crate9 depot)
   deleted: (at-crate crate9 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate9)
   goals met: 9 of 36
35. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 8 of 36
36. (deliver drone1 drone1_arm2 crate9 person32 loc7 food)
   deleted: (holding drone1_arm2 crate9)
   added: (person-has person32 food) (free drone1_arm2)
   goals met: 9 of 36
37. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 10 of 36
38. (pick-up drone1 drone1_arm2 crate8 depot)
   deleted: (at-crate crate8 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate8)
   goals met: 10 of 36
39. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 9 of 36
40. (deliver drone1 drone1_arm1 crate28 person10 loc6 medicine)
   deleted: (holding drone1_arm1 crate28)
   added: (person-has person10 medicine) (free drone1_arm1)
   goals met: 10 of 36
41. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 11 of 36
42. (pick-up drone1 drone1_arm1 crate27 depot)
   deleted: (at-crate crate27 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate27)
   goals met: 11 of 36
43. (fly drone1 depot loc34)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc34)
   goals met: 10 of 36
44. (deliver drone1 drone1_arm2 crate8 person18 loc34 food)
   deleted: (holding drone1_arm2 crate8)
   added: (person-has person18 food) (free drone1_arm2)
   goals met: 11 of 36
45. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 12 of 36
46. (pick-up drone1 drone1_arm2 crate7 depot)
   deleted: (at-crate crate7 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate7)
   goals met: 12 of 36
47. (fly drone1 depot loc34)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc34)
   goals met: 11 of 36
48. (deliver drone1 drone1_arm1 crate27 person18 loc34 medicine)
   deleted: (holding drone1_arm1 crate27)
   added: (person-has person18 medicine) (free drone1_arm1)
   goals met: 12 of 36
49. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 13 of 36
50. (pick-up drone1 drone1_arm1 crate26 depot)
   deleted: (at-crate crate26 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate26)
   goals met: 13 of 36
51. (fly drone1 depot loc34)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc34)
   goals met: 12 of 36
52. (deliver drone1 drone1_arm1 crate26 person24 loc34 medicine)
   deleted: (holding drone1_arm1 crate26)
   added: (person-has person24 medicine) (free drone1_arm1)
   goals met: 13 of 36
53. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 14 of 36
54. (pick-up drone1 drone1_arm1 crate25 depot)
   deleted: (at-crate crate25 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate25)
   goals met: 14 of 36
55. (fly drone1 depot loc31)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc31)
   goals met: 13 of 36
56. (deliver drone1 drone1_arm2 crate7 person26 loc31 food)
   deleted: (holding drone1_arm2 crate7)
   added: (person-has person26 food) (free drone1_arm2)
   goals met: 14 of 36
57. (deliver drone1 drone1_arm1 crate25 person26 loc31 medicine)
   deleted: (holding drone1_arm1 crate25)
   added: (person-has person26 medicine) (free drone1_arm1)
   goals met: 15 of 36
58. (fly drone1 loc31 depot)
   deleted: (at-drone drone1 loc31)
   added: (at-drone drone1 depot)
   goals met: 16 of 36
59. (pick-up drone1 drone1_arm1 crate24 depot)
   deleted: (at-crate crate24 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate24)
   goals met: 16 of 36
60. (pick-up drone1 drone1_arm2 crate6 depot)
   deleted: (at-crate crate6 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate6)
   goals met: 16 of 36
61. (fly drone1 depot loc28)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc28)
   goals met: 15 of 36
62. (deliver drone1 drone1_arm1 crate24 person5 loc28 medicine)
   deleted: (holding drone1_arm1 crate24)
   added: (person-has person5 medicine) (free drone1_arm1)
   goals met: 16 of 36
63. (fly drone1 loc28 depot)
   deleted: (at-drone drone1 loc28)
   added: (at-drone drone1 depot)
   goals met: 17 of 36
64. (pick-up drone1 drone1_arm1 crate23 depot)
   deleted: (at-crate crate23 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate23)
   goals met: 17 of 36
65. (fly drone1 depot loc28)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc28)
   goals met: 16 of 36
66. (deliver drone1 drone1_arm1 crate23 person25 loc28 medicine)
   deleted: (holding drone1_arm1 crate23)
   added: (person-has person25 medicine) (free drone1_arm1)
   goals met: 17 of 36
67. (fly drone1 loc28 depot)
   deleted: (at-drone drone1 loc28)
   added: (at-drone drone1 depot)
   goals met: 18 of 36
68. (pick-up drone1 drone1_arm1 crate22 depot)
   deleted: (at-crate crate22 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate22)
   goals met: 18 of 36
69. (fly drone1 depot loc25)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc25)
   goals met: 17 of 36
70. (deliver drone1 drone1_arm2 crate6 person14 loc25 food)
   deleted: (holding drone1_arm2 crate6)
   added: (person-has person14 food) (free drone1_arm2)
   goals met: 18 of 36
71. (fly drone1 loc25 depot)
   deleted: (at-drone drone1 loc25)
   added: (at-drone drone1 depot)
   goals met: 19 of 36
72. (pick-up drone1 drone1_arm2 crate5 depot)
   deleted: (at-crate crate5 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate5)
   goals met: 19 of 36
73. (fly drone1 depot loc25)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc25)
   goals met: 18 of 36
74. (deliver drone1 drone1_arm1 crate22 person9 loc25 medicine)
   deleted: (holding drone1_arm1 crate22)
   added: (person-has person9 medicine) (free drone1_arm1)
   goals met: 19 of 36
75. (fly drone1 loc25 depot)
   deleted: (at-drone drone1 loc25)
   added: (at-drone drone1 depot)
   goals met: 20 of 36
76. (pick-up drone1 drone1_arm1 crate21 depot)
   deleted: (at-crate crate21 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate21)
   goals met: 20 of 36
77. (fly drone1 depot loc25)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc25)
   goals met: 19 of 36
78. (deliver drone1 drone1_arm1 crate21 person14 loc25 medicine)
   deleted: (holding drone1_arm1 crate21)
   added: (person-has person14 medicine) (free drone1_arm1)
   goals met: 20 of 36
79. (fly drone1 loc25 depot)
   deleted: (at-drone drone1 loc25)
   added: (at-drone drone1 depot)
   goals met: 21 of 36
80. (pick-up drone1 drone1_arm1 crate20 depot)
   deleted: (at-crate crate20 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate20)
   goals met: 21 of 36
81. (fly drone1 depot loc24)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc24)
   goals met: 20 of 36
82. (deliver drone1 drone1_arm2 crate5 person29 loc24 food)
   deleted: (holding drone1_arm2 crate5)
   added: (person-has person29 food) (free drone1_arm2)
   goals met: 21 of 36
83. (deliver drone1 drone1_arm1 crate20 person29 loc24 medicine)
   deleted: (holding drone1_arm1 crate20)
   added: (person-has person29 medicine) (free drone1_arm1)
   goals met: 22 of 36
84. (fly drone1 loc24 depot)
   deleted: (at-drone drone1 loc24)
   added: (at-drone drone1 depot)
   goals met: 23 of 36
85. (pick-up drone1 drone1_arm1 crate19 depot)
   deleted: (at-crate crate19 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate19)
   goals met: 23 of 36
86. (pick-up drone1 drone1_arm2 crate4 depot)
   deleted: (at-crate crate4 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate4)
   goals met: 23 of 36
87. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 22 of 36
88. (deliver drone1 drone1_arm2 crate4 person2 loc18 food)
   deleted: (holding drone1_arm2 crate4)
   added: (person-has person2 food) (free drone1_arm2)
   goals met: 23 of 36
89. (deliver drone1 drone1_arm1 crate19 person2 loc18 medicine)
   deleted: (holding drone1_arm1 crate19)
   added: (person-has person2 medicine) (free drone1_arm1)
   goals met: 24 of 36
90. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 25 of 36
91. (pick-up drone1 drone1_arm1 crate18 depot)
   deleted: (at-crate crate18 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate18)
   goals met: 25 of 36
92. (pick-up drone1 drone1_arm2 crate3 depot)
   deleted: (at-crate crate3 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate3)
   goals met: 25 of 36
93. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 24 of 36
94. (deliver drone1 drone1_arm1 crate18 person3 loc13 medicine)
   deleted: (holding drone1_arm1 crate18)
   added: (person-has person3 medicine) (free drone1_arm1)
   goals met: 25 of 36
95. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 26 of 36
96. (pick-up drone1 drone1_arm1 crate17 depot)
   deleted: (at-crate crate17 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate17)
   goals met: 26 of 36
97. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 25 of 36
98. (deliver drone1 drone1_arm1 crate17 person15 loc13 medicine)
   deleted: (holding drone1_arm1 crate17)
   added: (person-has person15 medicine) (free drone1_arm1)
   goals met: 26 of 36
99. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 27 of 36
100. (pick-up drone1 drone1_arm1 crate16 depot)
   deleted: (at-crate crate16 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate16)
   goals met: 27 of 36
101. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 26 of 36
102. (deliver drone1 drone1_arm2 crate3 person13 loc9 food)
   deleted: (holding drone1_arm2 crate3)
   added: (person-has person13 food) (free drone1_arm2)
   goals met: 27 of 36
103. (deliver drone1 drone1_arm1 crate16 person13 loc9 medicine)
   deleted: (holding drone1_arm1 crate16)
   added: (person-has person13 medicine) (free drone1_arm1)
   goals met: 28 of 36
104. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 29 of 36
105. (pick-up drone1 drone1_arm1 crate15 depot)
   deleted: (at-crate crate15 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate15)
   goals met: 29 of 36
106. (pick-up drone1 drone1_arm2 crate2 depot)
   deleted: (at-crate crate2 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate2)
   goals met: 29 of 36
107. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 28 of 36
108. (deliver drone1 drone1_arm2 crate2 person8 loc8 food)
   deleted: (holding drone1_arm2 crate2)
   added: (person-has person8 food) (free drone1_arm2)
   goals met: 29 of 36
109. (deliver drone1 drone1_arm1 crate15 person8 loc8 medicine)
   deleted: (holding drone1_arm1 crate15)
   added: (person-has person8 medicine) (free drone1_arm1)
   goals met: 30 of 36
110. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 31 of 36
111. (pick-up drone1 drone1_arm1 crate14 depot)
   deleted: (at-crate crate14 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate14)
   goals met: 31 of 36
112. (pick-up drone1 drone1_arm2 crate1 depot)
   deleted: (at-crate crate1 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate1)
   goals met: 31 of 36
113. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 30 of 36
114. (deliver drone1 drone1_arm2 crate1 person12 loc2 food)
   deleted: (holding drone1_arm2 crate1)
   added: (person-has person12 food) (free drone1_arm2)
   goals met: 31 of 36
115. (deliver drone1 drone1_arm1 crate14 person12 loc2 medicine)
   deleted: (holding drone1_arm1 crate14)
   added: (person-has person12 medicine) (free drone1_arm1)
   goals met: 32 of 36
116. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 33 of 36
117. (pick-up drone1 drone1_arm1 crate13 depot)
   deleted: (at-crate crate13 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate13)
   goals met: 33 of 36
118. (pick-up drone1 drone1_arm2 crate12 depot)
   deleted: (at-crate crate12 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate12)
   goals met: 33 of 36
119. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 32 of 36
120. (deliver drone1 drone1_arm2 crate12 person34 loc2 medicine)
   deleted: (holding drone1_arm2 crate12)
   added: (person-has person34 medicine) (free drone1_arm2)
   goals met: 33 of 36
121. (fly drone1 loc2 loc1)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 loc1)
   goals met: 33 of 36
122. (deliver drone1 drone1_arm1 crate13 person1 loc1 medicine)
   deleted: (holding drone1_arm1 crate13)
   added: (person-has person1 medicine) (free drone1_arm1)
   goals met: 34 of 36
123. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 35 of 36
124. (pick-up drone1 drone1_arm1 crate11 depot)
   deleted: (at-crate crate11 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate11)
   goals met: 35 of 36
125. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 34 of 36
126. (deliver drone1 drone1_arm1 crate11 person30 loc1 medicine)
   deleted: (holding drone1_arm1 crate11)
   added: (person-has person30 medicine) (free drone1_arm1)
   goals met: 35 of 36
127. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 36 of 36
